advanced/backend/controllers/GoodsController.php

SELECT * FROM `category` WHERE `cat_status`='1'
---
    public function actionAddgoods()
    {
        //echo $_SERVER['HTTP_HOST'];
        $model=new Category();
        $result=$model->find()->where(['cat_status'=>'1'])->all();    //返回所有数据