advanced/backend/controllers/IndexController.php

SELECT * FROM `admin_user` WHERE (`username`='jian') AND (`password`='123456')
---
	public function actionLogin_pro(){
		$name=@$_POST['username'];
            $pwd=@$_POST['password'];
            $a=AdminUser::find()->where(['username' => $name,'password' => $pwd])->one();