advanced/backend/controllers/UserController.php

    public function actionIndex()
    {

		$url='http://'.$_SERVER['SERVER_NAME'].$_SERVER["REQUEST_URI"];
		$url=dirname($url);


		$id=$_COOKIE['uid'];
		$connection = \Yii::$app->db;
		$command = $connection->createCommand('SELECT role FROM admin_user WHERE uid='.$id);
		$post = $command->queryOne();


		$command = $connection->createCommand('SELECT * FROM role WHERE id='.$post['role']);
		$role = $command->queryOne();
		//print_r($role);


		$u=substr(strrchr($url,"="),1);
		foreach($role as $k=>$v){
			if(strpos($k,$u)){
				if($role[$k]!=1){
					echo "<script>alert('对不起，您的权限不够。无法访问');location.href='./index.php?r=index/norole'</script>";
				}
			}
		}
		$model=new query();
		if(@$_POST){
			$arr=$model->from(['admin_user','role'])->where("admin_user.role=role.id and username like '%".$_POST['username']."%'")->all();
		}else{
			$arr=$model->from(['admin_user','role'])->where("admin_user.role=role.id")->all();
---
SELECT * FROM `admin_user`, `role` WHERE admin_user.role=role.id