advanced/frontend/controllers/CategoryController.php

SELECT * FROM `category` WHERE `cat_status`=1
---
	public function actionIndex()
    {
		$cat=new Category();
		$c=$cat->find()->where(['cat_status'=>1])->all();