advanced/frontend/controllers/GoodsController.php

SELECT * FROM `category` WHERE `cat_status`=1
SELECT * FROM `goods` WHERE `goods_id`='18'
SELECT * FROM `goods` LIMIT 2
SELECT * FROM `goods` LIMIT 4
SELECT * FROM `comment` WHERE `goods_id`='18'
---
	public function actionIndex()
    {
		//导航
		$cat=new Category();
		$c=$cat->find()->where(['cat_status'=>1])->all();
		//print_r($c);die;
		//商品信息
		$gid=$_GET['gid'];
		$goo= new Goods();
		$data=$goo->find()->where(['goods_id'=>$gid])->one();
		//浏览记录
		$data1=$goo->find()->limit(2)->all();
		//print_R($data1);die;
		//热卖产品
		$datar=$goo->find()->limit(4)->all();
		//评论
		$com=new Comment();
		$pin=$com->find()->where(['goods_id'=>$gid])->all();

SELECT * FROM `category` WHERE `cat_status`=1
SELECT * FROM `goods`, `cart` WHERE goods.goods_id=cart.goods_id and cart.uid='1'
SELECT * FROM `goods` ORDER BY `goods_addtime` LIMIT 5
---
    public function actionShopcarlist()
    {

        $session = new Session;
        $uid=$session->get('uid');
        //echo $uid;die;
        if(empty($uid)){
            echo "<script>location.href='index.php?r=login';</script>";die;
        }
        $this->layout='@app/views/layouts/layout.php';
        $category=new Category();//导航栏
        $view = Yii::$app->view;
        $view->params['layoutData']=$category->find()->where(['cat_status'=>1])->all();
        //两表联查购物车
        $Query=new Query();
        $result=$Query->from(['goods','cart'])->where("goods.goods_id=cart.goods_id and cart.uid='$uid'")->all();
        $sum=0;
        foreach($result as $val){
            $sum+=$val['goods_price']*$val['cart_number'];
        }
        $arr['count']=count($result);
        $arr['sum']=$sum;
        //两表联查其他用户购买的商品
        $data=$Query->from(['goods','cart'])->where(!['cart.uid'=>$uid])->orderBy('cart.addtime','desc')->limit(2)->all();
        // var_dump($data);die;
        //查询商品表最新商品
        $Goods=new Goods();
        $array=$Goods->find()->orderBy('goods_addtime','desc')->limit(5)->all();