advanced/frontend/controllers/IndexController.php

    public function actionIndex()
    {
        $this->layout='@app/views/layouts/layout.php';
        $model=new Goods();
        $category=new Category();//导航栏
        $view = Yii::$app->view;
        $view->params['layoutData']=$category->find()->where(['cat_status'=>1])->all();


        $result=$model->find()->where(['goods_status'=>'1','cat_id'=>'8'])->orderBy('goods_addtime','desc')->limit(2)->all();
        $result2=$model->find()->where(['goods_status'=>'1','cat_id'=>'9'])->orderBy('goods_addtime','desc')->limit(2)->all();
        $result3=$model->find()->where(['goods_status'=>'1','cat_id'=>'10'])->orderBy('goods_addtime','desc')->limit(3)->all();
        $result4=$model->find()->where(['goods_status'=>'0','cat_id'=>'5'])->orderBy('goods_addtime','desc')->limit(1)->all();
---
SELECT * FROM `category` WHERE `cat_status`=1
SELECT * FROM `goods` WHERE (`goods_status`='1') AND (`cat_id`='8') ORDER BY `goods_addtime` LIMIT 2
SELECT * FROM `goods` WHERE (`goods_status`='1') AND (`cat_id`='9') ORDER BY `goods_addtime` LIMIT 2
SELECT * FROM `goods` WHERE (`goods_status`='1') AND (`cat_id`='10') ORDER BY `goods_addtime` LIMIT 3
SELECT * FROM `goods` WHERE (`goods_status`='0') AND (`cat_id`='5') ORDER BY `goods_addtime` LIMIT 1