advanced/frontend/controllers/LoginController.php

	public function actionLogin_pro()
	{
		 $name=@$_POST['username'];
		//var_dump($name);
         $pwd=@$_POST['password'];

         $a=Users::find()->where(['username' => $name,'password' => $pwd])->one();
---
SELECT * FROM `users` WHERE (`username`='jian') AND (`password`='123456')